{
  "sections": [
    {
      "title": "Professional Summary",
      "items": [
        {
          "description": "Software Engineer specializing in AI/ML with expertise in designing and deploying large language model (LLM) systems in production environments. Experienced in building agentic and retrieval-augmented generation (RAG) tools for enterprise applications, optimizing performance and cost efficiency. Skilled in backend and cloud-native development with a strong track record of delivering scalable, reliable AI-powered solutions in fast-paced, collaborative environments."
        }
      ]
    },
    {
      "title": "Work Experience",
      "items": [
        {
          "title": "Software Engineer (AI Solutions)",
          "subtitle": "Pacific Investment Management Company (PIMCO)",
          "date": "Jan 2024 - Present",
          "description": "Developed agentic Python application using AutoGen and OpenAI GPT-4 to answer performance and positioning NLP queries, improving analyst productivity by 60%. Built C#/.NET RAG-based tool to prefill DDQs, reducing manual workload by 40%. Authored and presented firmwide LLM Cost Optimization Guide, decreasing LLM usage costs by ~50%. Created regression testing framework for agentic applications to ensure accuracy across iterations. Deployed ML-powered apps on AWS EKS; monitored using Datadog and Komodor. Tech Stack: Python, AutoGen, OpenAI API, C#, .NET, SQL, AWS, JavaScript"
        },
        {
          "title": "Software Engineer (Compliance)",
          "subtitle": "Pacific Investment Management Company (PIMCO)",
          "date": "Feb 2022 - Dec 2023",
          "description": "Developed monitoring service to flag slow/hung nodes, enhancing system resilience. Upgraded hedging service (Java version, GitLab migration, API refactor). Managed weekly production releases and implemented usability improvements in compliance engine. Tech Stack: Java, Python, Bash, AVRO, SQL, Splunk, Autosys"
        },
        {
          "title": "Technology Analyst Intern (Compliance)",
          "subtitle": "Pacific Investment Management Company (PIMCO)",
          "date": "Jun 2021 - Aug 2021",
          "description": "Developed tagging enhancement for Rev3 Compliance Engine to organize and navigate components. Developed back end in Java and used transactional based Oracle queries to update database. Defined AVRO schemas to send and receive data between the server and UI. Presented and demoed tagging enhancement to over 100 employees at end of summer."
        },
        {
          "title": "Technology Analyst Intern (Booking Platform)",
          "subtitle": "Pacific Investment Management Company (PIMCO)",
          "date": "Jun 2020 - Aug 2020",
          "description": "Full stack development of audit service for Booking Platform, deployed on PCF. Managed the project from inception to production deployment including full design documentation. Developed back end in Java using Spring framework connected to Oracle database using AMPS Topics. Presented and demoed working audit service to over 100 employees at end of summer."
        },
        {
          "title": "Application Specialist Intern",
          "subtitle": "W-Systems",
          "date": "Jun 2019 - Aug 2019",
          "description": "Coded in PHP within SugarCRM’s framework to customize client instances. Managed a project through the full engineering life cycle that involved DocuSign API. Solved bugs in client instances by running database queries and cleaning up faulty code. Upgraded client instances by altering databases, PHP, JavaScript and MySQL code."
        }
      ]
    },
    {
      "title": "Education",
      "items": [
        {
          "title": "Master of Science in Electrical and Computer Engineering",
          "subtitle": "University of Texas at Austin",
          "date": "2020 - 2021",
          "description": "Focused on AI, distributed systems, and blockchain. GPA: 3.9/4.0"
        },
        {
          "title": "Bachelor of Science in Electrical and Computer Engineering",
          "subtitle": "University of Texas at Austin",
          "date": "2017 - 2020",
          "description": "Progressed from binary to assembly to OOP languages. GPA: 3.5/4.0"
        }
      ]
    },
    {
      "title": "Skills & Technologies",
      "items": [
        {
          "title": "Programming Languages",
          "description": "Python, Java, C#, C++, C, PHP, ARM ASM, TypeScript, JavaScript, Go, Scala"
        },
        {
          "title": "AI & Machine Learning",
          "description": "Autogen, LLM APIs, MCP, LangChain, Hugging Face, PyTorch"
        },
        {
          "title": "Web Technologies",
          "description": "React, Next.js, Node.js, GraphQL"
        },
        {
          "title": "Cloud & DevOps",
          "description": "AWS, Docker, Kubernetes, Git, CI/CD"
        }
      ]
    },
    {
      "title": "Certifications",
      "items": [
        {
          "title": "Pluralsight Python Expert",
          "subtitle": "Pluralsight",
          "date": "2025",
          "description": "Completed assessment to quantify understanding of Python at an Expert level."
        },
        {
          "title": "Pluralsight AI Expert",
          "subtitle": "Pluralsight",
          "date": "2025",
          "description": "Completed assessment to quantify understanding of AI at an Expert level."
        }
      ]
    }
  ]
}
